artillery-test.yml
config:
  ensure:
    p99: 50
  target: "http://localhost:8010"
  phases:
    - duration: 30
      arrivalRate: 200
      name: Load Testing

scenarios:
  - name: "Health Check [GET /health]"
    flow:
      - get:
          url: "/health"
  - name: "Create Ride [POST /rides]"
    flow:
      - post:
          url: "/rides"
          json:
            start_lat: "{{ $randomNumber(-90, 90) }}"
            start_long: "{{ $randomNumber(-180, 180) }}"
            end_lat: "{{ $randomNumber(-90, 90) }}"
            end_long: "{{ $randomNumber(-180, 180) }}"
            rider_name: "{{ $randomString() }}"
            driver_name: "{{ $randomString() }}"
            driver_vehicle: "{{ $randomString() }}"
  - name: "Get Ride by ID [GET /rides/{id}]"
    flow:
      - get:
          url: "/rides/{{ $randomNumber(1, 100) }}"
  - name: "Get All Rides [GET /rides]"
    flow:
      - get:
          url: "/rides"